export const customersDetailsMessages = {
  deleteAddress: {
    success: {
      title: "Адресата е успешно отстранета",
      text: "Адресата на клиентот е отстранета од системот.",
    },
    error: {
      title: "Бришењето не беше успешно",
      text: "Не можевме да ја отстраниме адресата во моментов. Ве молиме обидете се повторно.",
    },
  },

  deleteNote: {
    success: {
      title: "Забелешката е успешно отстранета",
      text: "Забелешката за клиентот е отстранета од системот.",
    },
    error: {
      title: "Бришењето не беше успешно",
      text: "Не можевме да ја отстраниме забелешката во моментов. Ве молиме обидете се повторно.",
    },
  },

  deleteCustomer: {
    success: {
      title: "Клиентот е успешно отстранет",
      text: "Клиентот е отстранет од системот.",
    },
    error: {
      title: "Бришењето не беше успешно",
      text: "Не можевме да го отстраниме клиентот во моментов. Ве молиме обидете се повторно.",
    },
  },
} as const;
