export const customersMessages = {
  deleteOne: {
    success: {
      title: "Клиентот е успешно отстранет",
      text: "Клиентот е отстранет од системот.",
    },
    error: {
      title: "Бришењето не беше успешно",
      text: "Не можевме да го отстраниме клиентот во моментов. Ве молиме обидете се повторно.",
    },
  },

  deleteBulk: (count: number) => ({
    success: {
      title:
        count === 1
          ? "Клиентот е успешно отстранет"
          : `Успешно отстранети ${count} клиенти`,
      text:
        count === 1
          ? "Клиентот е отстранет од системот."
          : `Отстранети се ${count} клиенти од системот.`,
    },
    error: {
      title: "Бришењето не беше успешно",
      text: "Не можевме да ги отстраниме клиентите во моментов. Ве молиме обидете се повторно.",
    },
  }),
} as const;
